#                                    #
#       패스트 캠퍼스 온라인         #
#   금융 공학 / 퀀트 올인원 패키지   #
#    R 프로그래밍 - 강사. 박찬엽     #
#                                    #

# 프로그램의 기본  ----
## 11. 함수의 구조 ----
## 12. 조건문 if ----
## 12.1 조건문의 구조

조건 <- 논리형 스칼라

if (조건) {
  조건이 맞을 때 실행해야 할 내용
} else {
  조건에 맞지 않을 때 실행해야 할 내용
}

# if만 작성할 수 있습니다.
if (조건) {
  조건이 맞을 때 실행해야 할 내용
}

# 중첩해서 작성할 수 있습니다.
if (조건1) {
  조건1이 맞을 때 실행해야 할 내용
} else if (조건2) {
  조건1은 맞지 않고 조건2는 맞을 때 실행해야 할 내용
} else {
  모든 조건에 맞지 않을 때 실행해야 할 내용
}

## 12.2 논리형 데이터의 연산
== : 같다
!= : 같다가 아니다 = 다르다
>  : 왼쪽이 크다
<  : 오른쪽이 크다
>= : 왼쪽이 크거나 같다
<= : 오른쪽이 크거나 같다


## 13. 조건문을 작성하는 요령 ----
## 14. 다중 조건 switch ----
## 15. 반복문 for ----
## 16. 반복문 작성 예시 ----
## 17. 에러 처리 ----
